files/xml/8.7.0.7/0031__HouseManagmentBinding__importHouseRSOData__create1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://dom.gosuslugi.ru/schema/integration/{{.HuisVer}}/" xmlns:hous="http://dom.gosuslugi.ru/schema/integration/{{.HuisVer}}/house-management/" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
   <soapenv:Header>
      <ns:RequestHeader>
         <ns:Date>{{CurDateTime1}}</ns:Date>
         <ns:MessageGUID>{{RandomGUID}}</ns:MessageGUID>
         <!-- запрос по УК  {{index .Data "uk"}}  -->
         <ns:SenderID>{{index .Data "SenderID"}}</ns:SenderID>
         <ns:IsOperatorSighnature>true</ns:IsOperatorSighnature>
      </ns:RequestHeader>
   </soapenv:Header>
   <soapenv:Body>
      <hous:importHouseRSORequest>
         <hous:ApartmentHouse>
            <hous:ApartmentHouseToCreate>
               <hous:BasicCharacteristicts>
              
<hous:No_RSO_GKN_EGRP_Data>true</hous:No_RSO_GKN_EGRP_Data>

          <hous:FIASHouseGuid>{{index .Data "FIASHouseGuid_mira19"}}</hous:FIASHouseGuid>
                  <hous:OKTMO>
                     <ns:code>87715000001</ns:code>
                  </hous:OKTMO>

                  <hous:OlsonTZ>
                     <ns:Code>1</ns:Code>
                     <ns:GUID>caf02596-6558-4bb6-a960-3c691925d3d5</ns:GUID>
                  </hous:OlsonTZ>

               </hous:BasicCharacteristicts>
               <ns:TransportGUID>{{RandomGUID}}</ns:TransportGUID>
            </hous:ApartmentHouseToCreate>

             <hous:EntranceToCreate>
               <hous:EntranceNum>1</hous:EntranceNum>
               <ns:TransportGUID>{{RandomGUID}}</ns:TransportGUID>
            </hous:EntranceToCreate>

             <hous:ResidentialPremises>
               <hous:ResidentialPremisesToCreate>
<hous:No_RSO_GKN_EGRP_Registered>true</hous:No_RSO_GKN_EGRP_Registered>
                  <hous:PremisesNum>1</hous:PremisesNum>
                  <hous:EntranceNum>1</hous:EntranceNum>
                  <hous:PremisesCharacteristic>
                    <ns:Code>1</ns:Code>
                    <ns:GUID>96a1ce61-b402-46c4-ac6e-34b8670480af</ns:GUID>
                  </hous:PremisesCharacteristic>
                  <ns:TransportGUID>{{RandomGUID}}</ns:TransportGUID>
               </hous:ResidentialPremisesToCreate>
            </hous:ResidentialPremises>

         </hous:ApartmentHouse>
      </hous:importHouseRSORequest>
   </soapenv:Body>
</soapenv:Envelope>